IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f28p65x_emif1_config_regs.xml
<module id="EMIF1_CONFIG_REGS" HW_revision="" description="EMIF1 CONFIG Registers">
	<register id="EMIF1LOCK" width="32" page="1" offset="0x0" internal="0" description="EMIF1 Config Lock Register">
		<bitfield id="LOCK_EMIF1" description="EMIF1 access protection and controller fields lock bit" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="EMIF1COMMIT" width="32" page="1" offset="0x2" internal="0" description="EMIF1 Config Lock Commit Register">
		<bitfield id="COMMIT_EMIF1" description="EMIF1 access protection and controller select permanent lock" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="EMIF1MSEL" width="32" page="1" offset="0x4" internal="0" description="EMIF1 Controller Sel Register">
		<bitfield id="MSEL_EMIF1" description="Controller Select for EMIF1." begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="KEY" description="KEY to enable the write into MSEL_EMIF1 bits" begin="31" end="4" width="28" rwaccess="RW"/>
	</register>
	<register id="EMIF1ACCPROT0" width="32" page="1" offset="0x8" internal="0" description="EMIF1 Config Register 0">
		<bitfield id="FETCHPROT_EMIF1" description="Fetch Protection For EMIF1" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="CPUWRPROT_EMIF1" description="CPU WR Protection For EMIF1" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="DMAWRPROT_EMIF1" description="DMA WR Protection For EMIF1" begin="2" end="2" width="1" rwaccess="RW"/>
	</register>
</module>
